# ANOVA

In [1]:
import pandas as pd
from scipy import stats

In [2]:
# ejemplo plantas

df=pd.read_csv('data/PlantGrowth.csv')
df.head()

   Unnamed: 0  weight group
0           1    4.17  ctrl
1           2    5.58  ctrl
2           3    5.18  ctrl
3           4    6.11  ctrl
4           5    4.50  ctrl

In [3]:
df.group.unique()

array(['ctrl', 'trt1', 'trt2'], dtype=object)

In [4]:
df_anova=df[['weight','group']]

grupos=df.group.unique()

In [7]:
data={g:df_anova.weight[df_anova.group==g] for g in grupos}
data

{'ctrl': 0    4.17
 1    5.58
 2    5.18
 3    6.11
 4    4.50
 5    4.61
 6    5.17
 7    4.53
 8    5.33
 9    5.14
 Name: weight, dtype: float64, 'trt1': 10    4.81
 11    4.17
 12    4.41
 13    3.59
 14    5.87
 15    3.83
 16    6.03
 17    4.89
 18    4.32
 19    4.69
 Name: weight, dtype: float64, 'trt2': 20    6.31
 21    5.12
 22    5.54
 23    5.50
 24    5.37
 25    5.29
 26    4.92
 27    6.15
 28    5.80
 29    5.26
 Name: weight, dtype: float64}

In [9]:
f_score, p_value=stats.f_oneway(data['ctrl'], data['trt1'], data['trt2'])
print (f_score, p_value)

4.846087862380136 0.0159099583256229

In [10]:
# ejemplo ciudades

import matplotlib.pyplot as plt
import numpy as np
from scipy.stats import f_oneway
from scipy.stats import linregress
import statsmodels.api as sm
from statsmodels.formula.api import ols
from scipy.stats import f

In [11]:
rate=pd.read_csv('data/rate_by_city.csv')
rate.head()

    Rate  City
0  13.75     1
1  13.75     1
2  13.50     1
3  13.50     1
4  13.00     1

In [13]:
rate.City.unique()

array([1, 2, 3, 4, 5, 6])

In [15]:
rate['city_count']=rate.groupby('City').cumcount()
rate_pivot=rate.pivot(columns='City', values='Rate', index='city_count')
rate_pivot

City            1      2      3      4      5      6
city_count
0           13.75  14.25  14.00  15.00  14.50  13.50
1           13.75  13.00  14.00  14.00  14.00  12.25
2           13.50  12.75  13.51  13.75  14.00  12.25
3           13.50  12.50  13.50  13.59  13.90  12.00
4           13.00  12.50  13.50  13.25  13.75  12.00
5           13.00  12.40  13.25  12.97  13.25  12.00
6           13.00  12.30  13.00  12.50  13.00  12.00
7           12.75  11.90  12.50  12.25  12.50  11.90
8           12.50  11.90  12.50  11.89  12.45  11.90

In [16]:
f_oneway(*[rate_pivot[i] for i in range(1, 7)])

F_onewayResult(statistic=4.8293848737024, pvalue=0.001174551414504048)

In [18]:
rate.describe()

            Rate       City  city_count
count  54.000000  54.000000   54.000000
mean   13.006667   3.500000    4.000000
std     0.785527   1.723861    2.606233
min    11.890000   1.000000    0.000000
25%    12.412500   2.000000    2.000000
50%    13.000000   3.500000    4.000000
75%    13.570000   5.000000    6.000000
max    15.000000   6.000000    8.000000

In [19]:
# F-test a mano

data=np.array([[1,2,3], [4,5,6], [7,8,9]]).T
data

array([[1, 4, 7],
       [2, 5, 8],
       [3, 6, 9]])

In [22]:
m=data.shape[1]
n=data.shape[0]

media=data.mean()

col_medias=data.mean(axis=0)

s_c_entre_grupos=(((col_medias-media)**2)*n).sum()
dof_sceg=m-1

s_c_grupo=((data-col_medias)**2).sum()
dof_scg=m*(n-1)

f_score=(s_c_entre_grupos/dof_sceg)/(s_c_grupo/dof_scg)
f_score

27.0

In [23]:
f_oneway(data[:, 0], data[:, 1], data[:, 2])

F_onewayResult(statistic=27.0, pvalue=0.0010000000000000002)